__Data analysis using Pandas__

__Q1. How to install Pandas library__

In [11]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dell\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

__Q2. How to import pandas in python__

In [91]:
import pandas as pd

__Q3. How to read csv file in pandas library__<br>
A) in following code __ff__ is a variable and __Null__ is csv file

In [122]:
ff=pd.read_csv("Null.csv")
ff

  E_id     Name   Salary  Gender
0  E001  Arvind   45000.0    Male
1   NaN   Anand       NaN     NaN
2  E003      NaN   1200.0     NaN
3  E004    Harsh      NaN    Male
4   NaN   Pooja   14000.0     NaN
5  E006      NaN      NaN     NaN
6   NaN   Ankit    5800.0     NaN
7  E008   Sonal       NaN   Male

__Q4. How to cheack total number of rows and columns__<br>
Then we have to use Shape attribute.

In [28]:
ff.shape

(8, 4)

__Q5. How to check information of data__<br>
.info()

In [37]:
ff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   E_id     5 non-null      object
 1   Name     6 non-null      object
 2   Salary   4 non-null      float64
 3   Gender   3 non-null      object
dtypes: float64(1), object(3)
memory usage: 388.0+ bytes

__Q6.How to check number of columns__<br>
columns

In [45]:
ff.columns

Index(['E_id ', 'Name ', 'Salary ', 'Gender '], dtype='object')

__Q7. How to check data type from Data__<br>
dtypes

In [52]:
ff.dtypes

E_id        object
Name        object
Salary     float64
Gender      object
dtype: object

__Q8. head()__<br>
head() method use to display top 5 row

In [56]:
ff.head()

  E_id     Name   Salary  Gender
0  E001  Arvind   45000.0    Male
1   NaN   Anand       NaN     NaN
2  E003      NaN   1200.0     NaN
3  E004    Harsh      NaN    Male
4   NaN   Pooja   14000.0     NaN

__Q9. tail()__<br>
tail() method use to display 5 row from buttom

In [61]:
ff.tail()

  E_id    Name   Salary  Gender
3  E004   Harsh      NaN    Male
4   NaN  Pooja   14000.0     NaN
5  E006     NaN      NaN     NaN
6   NaN  Ankit    5800.0     NaN
7  E008  Sonal       NaN   Male

__Q10. If we want to display only 3 rows from the top__<br>
use index number<br>
head(pass the index number)

In [68]:
ff.head(2)

  E_id     Name   Salary  Gender
0  E001  Arvind   45000.0    Male
1   NaN   Anand       NaN     NaN

__Q11. if you want to display only 3 rows from the buttom.__<br>
use index number<br>
tail(pass index number)

In [71]:
ff.tail(3)

  E_id    Name   Salary  Gender
5  E006     NaN      NaN     NaN
6   NaN  Ankit    5800.0     NaN
7  E008  Sonal       NaN   Male

In [19]:
ff

  E_id     Name   Salary  Gender
0  E001  Arvind   45000.0    Male
1   NaN   Anand       NaN     NaN
2  E003      NaN   1200.0     NaN
3  E004    Harsh      NaN    Male
4   NaN   Pooja   14000.0     NaN
5  E006      NaN      NaN     NaN
6   NaN   Ankit    5800.0     NaN
7  E008   Sonal       NaN   Male

__Q12. loc[]__<br>
Use the named index in the loc attribute to return the specified row(s).

In [21]:
print(ff.loc[0])

E_id          E001
Name       Arvind
Salary     45000.0
Gender        Male
Name: 0, dtype: object

__Q13. Fillna__<br>
Basically fillna use for to fill the null values<br>
The fillna() method allows us to replace empty cells with a value.

In [78]:
ff["Salary "].fillna(0,inplace=True)
ff

C:\Users\dell\AppData\Local\Temp\ipykernel_16016\991581000.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ff["Salary "].fillna(0,inplace=True)

  E_id     Name   Salary  Gender
0  E001  Arvind   45000.0    Male
1   NaN   Anand       0.0     NaN
2  E003      NaN   1200.0     NaN
3  E004    Harsh      0.0    Male
4   NaN   Pooja   14000.0     NaN
5  E006      NaN      0.0     NaN
6   NaN   Ankit    5800.0     NaN
7  E008   Sonal       0.0   Male

__Q14. dropna__<br>
dropna() use to remove null values

In [14]:
ff.dropna()

  E_id     Name   Salary  Gender
0  E001  Arvind   45000.0    Male

__Q15. How to use MEAN, MEDIAN, OR MODE?__

__mean()__<br>
Mean = the average value (the sum of all values divided by number of values).

In [31]:
m=ff["Salary "].mean()
m

16500.0

__mode()__<br>
Mode = the value that appears most frequently.

In [19]:
m=ff["Salary "].mode()
m

0     1200.0
1     5800.0
2    14000.0
3    45000.0
Name: Salary , dtype: float64

__median()__<br>
Median = the value in the middle, after you have sorted all values ascending.

In [22]:
m=ff["Salary "].median()
m

9900.0

In [30]:
m=ff["Salary "].median()
ff["Salary "].fillna(0,inplace=True)
print(m)

600.0

C:\Users\dell\AppData\Local\Temp\ipykernel_16672\2974896466.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ff["Salary "].fillna(0,inplace=True)

__Q16. Convert To DATE__ Format

In [36]:
ff["Salary "]=pd.to_datetime(ff["Salary "])
print(ff.to_string())

  E_id     Name                        Salary  Gender
0  E001  Arvind  1970-01-01 00:00:00.000045000    Male
1   NaN   Anand  1970-01-01 00:00:00.000000000     NaN
2  E003      NaN 1970-01-01 00:00:00.000001200     NaN
3  E004    Harsh 1970-01-01 00:00:00.000000000    Male
4   NaN   Pooja  1970-01-01 00:00:00.000014000     NaN
5  E006      NaN 1970-01-01 00:00:00.000000000     NaN
6   NaN   Ankit  1970-01-01 00:00:00.000005800     NaN
7  E008   Sonal  1970-01-01 00:00:00.000000000   Male

__Q17. dropna() with subset__

In [51]:
ff.dropna(subset=["Gender "],inplace=True)
ff

  E_id     Name                     Salary  Gender
0  E001  Arvind  1970-01-01 00:00:00.000045    Male
3  E004    Harsh 1970-01-01 00:00:00.000000    Male
7  E008   Sonal  1970-01-01 00:00:00.000000   Male

In [79]:
ff

  E_id     Name   Salary  Gender
0  E001  Arvind   45000.0    Male
1   NaN   Anand       NaN     NaN
2  E003      NaN   1200.0     NaN
3  E004    Harsh      NaN    Male
4   NaN   Pooja   14000.0     NaN
5  E006      NaN      NaN     NaN
6   NaN   Ankit    5800.0     NaN
7  E008   Sonal       NaN   Male

__Q18. Replace values__<br>
set "Salary "= 67000 in row 1 :

In [83]:
ff.loc[1,"Salary "]=67000
ff

  E_id     Name   Salary  Gender
0  E001  Arvind   45000.0    Male
1   NaN   Anand   67000.0     NaN
2  E003      NaN   1200.0     NaN
3  E004    Harsh      NaN    Male
4   NaN   Pooja   14000.0     NaN
5  E006      NaN      NaN     NaN
6   NaN   Ankit    5800.0     NaN
7  E008   Sonal       NaN   Male

__Q19. Duplicate values__

In [95]:
print(ff.duplicated)

<bound method DataFrame.duplicated of   E_id     Name   Salary  Gender
0  E001  Arvind   45000.0    Male
1   NaN   Anand       NaN     NaN
2  E003      NaN   1200.0     NaN
3  E004    Harsh      NaN    Male
4   NaN   Pooja   14000.0     NaN
5  E006      NaN      NaN     NaN
6   NaN   Ankit    5800.0     NaN
7  E008   Sonal       NaN   Male >

__Q20. Drop duplicates values__

In [117]:
ff.drop_duplicates(inplace=True)
ff

  E_id     Name   Salary  Gender
0  E001  Arvind   45000.0    Male
1   NaN   Anand       NaN     NaN
2  E003      NaN   1200.0     NaN
3  E004    Harsh      NaN    Male
4   NaN   Pooja   14000.0     NaN
5  E006      NaN      NaN     NaN
6   NaN   Ankit    5800.0     NaN
7  E008   Sonal       NaN   Male

__value_count()__

In [ ]:
ff.value_counts()

In [120]:
ff.corr()

ValueError: could not convert string to float: 'E001'